/*На прозореца на Слончето Лони има четири саксии с цветя. Те имат точно определени височини 
и Лони харесва, когато са подредени във възходящ ред на височината. Майка му всеки ден размества 
саксиите и слончето постоянно се обърква. Сега то иска да научи домашния си робот да ги подрежда. 
За целта му трябва програма sort, която по дадени височини на саксиите, изпраща на робота съобщение 
за това как са подредени саксиите.

Вход
На първия ред от стандартния вход се въвеждат четири цели числа h1, h2, h3, h4 – височините на саксиите 
на прозореца на Слончето Лони.

Изход
На един ред на стандартния изход програмата трябва да изведе Ascending, ако саксиите са със строго 
нарастващи височини, или съобщение Descending, ако саксиите са със строго намаляващи височини. 
Ако саксиите са разбъркани, програмата извежда съобщение Mixed.*/

import java.util.Scanner;

public class Sort {
    public static void main(String[] args) {
        Scanner console = new Scanner(System.in);

        int h1 = console.nextInt();
        int h2 = console.nextInt();
        int h3 = console.nextInt();
        int h4 = console.nextInt();

        if (h1 < h2 && h2 < h3 && h3 < h4){
            System.out.println("Ascending");
        }
        else if (h1 > h2 && h2 > h3 && h3 > h4){
            System.out.println("Descending");
        }
        else {
            System.out.println("Mixed");
        }
    }
}
